
# a = 1
# b = 1
# c = 1
# print(id(a))
# print(id(b))
# print(id(c))

# a = [11, 22, 33]
# b = [11, 22, 33]
# print(id(a))
# print(id(b))

# 2.
# Пусть у нас есть три переменные:
# Нужно, используя распаковку кортежа, поменять местами значения переменных a и b, а потом b и c.

# a = 1
# b = 2
# c = 3
# a, b = b, a
# print(a, b)
# a = 1
# b = 2
# c = 3
# b, c = c, b
# print(b, c)

#3.
# Пусть у нас есть словарь, где ключ это страна, а значение - столица:
# countries_capitals = {
#     'Belarus': 'Minsk',
#     'Poland': 'Warsaw',
#     'Great Britain': 'London',
# }
# Нужно вывести на экран, используя словарь, столицу Польши, а на следующей строке столицу Беларуси

# dictionary = {'Belarus': 'Minsk','Poland': 'Warsaw', 'Great Britain': 'London', }
# print(dictionary['Poland'])
# print(dictionary['Belarus'])

# 4.
# Пусть у нас есть массив слов food = ['котлета', 'пюрешка', 'драники', 'пицца', 'мороженное'].
# Вывести на консоль два блюда, которые больше всего нравятся, в формате:
# 'Из предложенного я больше люблю <блюдо1> и <блюдо2>'

# food = ['котлета', 'пюрешка', 'драники', 'пицца', 'мороженное']
# print(f"Из предложенного я больше люблю {food[0]} и {food[1]}")



#*5.
# Пусть в программе хранится список друзей:
# friends = ['Egor', 'Liza', 'Vanya', 'Yana']
# При запуске программа просит ввести имя, и проверяет, есть ли оно в списке.
# Если есть, вывести сообщение 'У меня есть друг <имя>',
# если нет, вывести 'У меня нет друга с именем <имя>'


#-------------------------------------


